Revit 2024 API
EnergyAnalysisDetailModel.ExportCategory Property
 Export elements of this category in energy analysis.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ElementId ExportCategory { get; set; }
Visual Basic
Public Property ExportCategory As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ ExportCategory {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 Export will be based on the space type associated with the product creating it. Valid categories are Rooms or MEP Spaces.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace